; domain
(define (domain curriculum)
(:requirements :strips :typing)

(:types 
content concept student - object
activity tutorial - content
)

(:predicates
(has_concept ?s - student ?c - concept)
(used_concept ?s - student ?c - concept)
(apply ?c - concept ?a - activity)
(applied ?c - concept ?a - activity)
(done ?s - student ?a - content)
(todo ?a - activity ?s - student)
(need_contribution ?s - student)
(lock ?s - student)
)

(:functions
(total-cost)
)

(:action apply
:parameters (?c - concept ?s - student ?a - activity)
:precondition (and
(apply ?c ?a)
(has_concept ?s ?c)
)
:effect (and
(not (apply ?c ?a))
(applied ?c ?a)
(used_concept ?s ?c)
(not (need_contribution ?s))
(increase (total-cost) 1)
)
)

(:action set_concepts_T8
:parameters (?s - student)
:precondition (and
(done ?s T8)
)
:effect (and
(has_concept ?s functions)
(has_concept ?s action-costs)
(increase (total-cost) 0)
)
)

(:action do_tutorial_T8
:parameters (?s - student)
:precondition (and)
:effect (and
(has_concept ?s functions)
(has_concept ?s action-costs)
(increase (total-cost) 9)
)
)

(:action set_concepts_T9
:parameters (?s - student)
:precondition (and
(done ?s T9)
)
:effect (and
(has_concept ?s adl)
(increase (total-cost) 0)
)
)

(:action do_tutorial_T9
:parameters (?s - student)
:precondition (and)
:effect (and
(has_concept ?s adl)
(increase (total-cost) 9)
)
)

(:action set_concepts_T6
:parameters (?s - student)
:precondition (and
(done ?s T6)
)
:effect (and
(has_concept ?s typing)
(increase (total-cost) 0)
)
)

(:action do_tutorial_T6
:parameters (?s - student)
:precondition (and)
:effect (and
(has_concept ?s typing)
(increase (total-cost) 9)
)
)

(:action set_concepts_T7
:parameters (?s - student)
:precondition (and
(done ?s T7)
)
:effect (and
(has_concept ?s equality)
(increase (total-cost) 0)
)
)

(:action do_tutorial_T7
:parameters (?s - student)
:precondition (and)
:effect (and
(has_concept ?s equality)
(increase (total-cost) 9)
)
)

(:action set_concepts_T4
:parameters (?s - student)
:precondition (and
(done ?s T4)
)
:effect (and
(has_concept ?s negative-conditions)
(increase (total-cost) 0)
)
)

(:action do_tutorial_T4
:parameters (?s - student)
:precondition (and)
:effect (and
(has_concept ?s negative-conditions)
(increase (total-cost) 9)
)
)

(:action set_concepts_T5
:parameters (?s - student)
:precondition (and
(done ?s T5)
)
:effect (and
(has_concept ?s action-costs)
(increase (total-cost) 0)
)
)

(:action do_tutorial_T5
:parameters (?s - student)
:precondition (and)
:effect (and
(has_concept ?s action-costs)
(increase (total-cost) 9)
)
)

(:action set_concepts_T2
:parameters (?s - student)
:precondition (and
(done ?s T2)
)
:effect (and
(has_concept ?s operators)
(increase (total-cost) 0)
)
)

(:action do_tutorial_T2
:parameters (?s - student)
:precondition (and)
:effect (and
(has_concept ?s operators)
(increase (total-cost) 9)
)
)

(:action set_concepts_T3
:parameters (?s - student)
:precondition (and
(done ?s T3)
)
:effect (and
(has_concept ?s states)
(increase (total-cost) 0)
)
)

(:action do_tutorial_T3
:parameters (?s - student)
:precondition (and)
:effect (and
(has_concept ?s states)
(increase (total-cost) 9)
)
)

(:action set_concepts_T0
:parameters (?s - student)
:precondition (and
(done ?s T0)
)
:effect (and
(has_concept ?s strips)
(increase (total-cost) 0)
)
)

(:action do_tutorial_T0
:parameters (?s - student)
:precondition (and)
:effect (and
(has_concept ?s strips)
(increase (total-cost) 9)
)
)

(:action set_concepts_T1
:parameters (?s - student)
:precondition (and
(done ?s T1)
)
:effect (and
(has_concept ?s propositions)
(increase (total-cost) 0)
)
)

(:action do_tutorial_T1
:parameters (?s - student)
:precondition (and)
:effect (and
(has_concept ?s propositions)
(increase (total-cost) 9)
)
)

(:action set_concepts_T10
:parameters (?s - student)
:precondition (and
(done ?s T10)
)
:effect (and
(has_concept ?s conditional-effects)
(increase (total-cost) 0)
)
)

(:action do_tutorial_T10
:parameters (?s - student)
:precondition (and)
:effect (and
(has_concept ?s conditional-effects)
(increase (total-cost) 9)
)
)

(:action set_concepts_T11
:parameters (?s - student)
:precondition (and
(done ?s T11)
)
:effect (and
(has_concept ?s domain-axioms)
(increase (total-cost) 0)
)
)

(:action do_tutorial_T11
:parameters (?s - student)
:precondition (and)
:effect (and
(has_concept ?s domain-axioms)
(increase (total-cost) 9)
)
)

(:action set_concepts_T12
:parameters (?s - student)
:precondition (and
(done ?s T12)
)
:effect (and
(has_concept ?s temporal-constraints)
(increase (total-cost) 0)
)
)

(:action do_tutorial_T12
:parameters (?s - student)
:precondition (and)
:effect (and
(has_concept ?s temporal-constraints)
(increase (total-cost) 9)
)
)

(:action do_activity_A1
:parameters (?s - student)
:precondition (and
(not (lock ?s))
(not (done ?s A1))
)
:effect (and
(lock ?s)
(todo A1 ?s)
(apply functions A1)
(apply negative-conditions A1)
(apply equality A1)
(need_contribution S5)
(increase (total-cost) 1)
)
)

(:action done_activity_A1
:parameters (?s - student)
:precondition (and
(todo A1 ?s)
(applied functions A1)
(applied negative-conditions A1)
(applied equality A1)
)
:effect (and
(not (lock ?s))
(not (todo A1 ?s))
(done ?s A1)
(not (applied functions A1))
(used_concept ?s functions)
(not (applied negative-conditions A1))
(used_concept ?s negative-conditions)
(not (applied equality A1))
(used_concept ?s equality)
(increase (total-cost) 0)
)
)

(:action do_activity_A0
:parameters (?s - student)
:precondition (and
(not (lock ?s))
(not (done ?s A0))
)
:effect (and
(lock ?s)
(todo A0 ?s)
(apply strips A0)
(apply propositions A0)
(apply operators A0)
(apply states A0)
(apply action-costs A0)
(apply typing A0)
(need_contribution S5)
(increase (total-cost) 1)
)
)

(:action done_activity_A0
:parameters (?s - student)
:precondition (and
(todo A0 ?s)
(applied strips A0)
(applied propositions A0)
(applied operators A0)
(applied states A0)
(applied action-costs A0)
(applied typing A0)
)
:effect (and
(not (lock ?s))
(not (todo A0 ?s))
(done ?s A0)
(not (applied strips A0))
(used_concept ?s strips)
(not (applied propositions A0))
(used_concept ?s propositions)
(not (applied operators A0))
(used_concept ?s operators)
(not (applied states A0))
(used_concept ?s states)
(not (applied action-costs A0))
(used_concept ?s action-costs)
(not (applied typing A0))
(used_concept ?s typing)
(increase (total-cost) 0)
)
)

(:action do_activity_A3
:parameters (?s - student)
:precondition (and
(not (lock ?s))
(not (done ?s A3))
)
:effect (and
(lock ?s)
(todo A3 ?s)
(apply adl A3)
(apply domain-axioms A3)
(apply conditional-effects A3)
(need_contribution S5)
(increase (total-cost) 1)
)
)

(:action done_activity_A3
:parameters (?s - student)
:precondition (and
(todo A3 ?s)
(applied adl A3)
(applied domain-axioms A3)
(applied conditional-effects A3)
)
:effect (and
(not (lock ?s))
(not (todo A3 ?s))
(done ?s A3)
(not (applied adl A3))
(used_concept ?s adl)
(not (applied domain-axioms A3))
(used_concept ?s domain-axioms)
(not (applied conditional-effects A3))
(used_concept ?s conditional-effects)
(increase (total-cost) 0)
)
)

(:action do_activity_A2
:parameters (?s - student)
:precondition (and
(not (lock ?s))
(not (done ?s A2))
)
:effect (and
(lock ?s)
(todo A2 ?s)
(apply adl A2)
(apply conditional-effects A2)
(need_contribution S5)
(increase (total-cost) 1)
)
)

(:action done_activity_A2
:parameters (?s - student)
:precondition (and
(todo A2 ?s)
(applied adl A2)
(applied conditional-effects A2)
)
:effect (and
(not (lock ?s))
(not (todo A2 ?s))
(done ?s A2)
(not (applied adl A2))
(used_concept ?s adl)
(not (applied conditional-effects A2))
(used_concept ?s conditional-effects)
(increase (total-cost) 0)
)
)

(:action do_activity_A5
:parameters (?s - student)
:precondition (and
(not (lock ?s))
(not (done ?s A5))
)
:effect (and
(lock ?s)
(todo A5 ?s)
(apply temporal-constraints A5)
(need_contribution S5)
(increase (total-cost) 1)
)
)

(:action done_activity_A5
:parameters (?s - student)
:precondition (and
(todo A5 ?s)
(applied temporal-constraints A5)
)
:effect (and
(not (lock ?s))
(not (todo A5 ?s))
(done ?s A5)
(not (applied temporal-constraints A5))
(used_concept ?s temporal-constraints)
(increase (total-cost) 0)
)
)

(:action do_activity_A4
:parameters (?s - student)
:precondition (and
(not (lock ?s))
(not (done ?s A4))
)
:effect (and
(lock ?s)
(todo A4 ?s)
(apply conditional-effects A4)
(need_contribution S5)
(increase (total-cost) 1)
)
)

(:action done_activity_A4
:parameters (?s - student)
:precondition (and
(todo A4 ?s)
(applied conditional-effects A4)
)
:effect (and
(not (lock ?s))
(not (todo A4 ?s))
(done ?s A4)
(not (applied conditional-effects A4))
(used_concept ?s conditional-effects)
(increase (total-cost) 0)
)
)



)

; problem
(define (problem prob-curriculum)
(:domain curriculum)

(:objects 
S3 S2 S1 S5 S4 - student
functions strips equality temporal-constraints propositions operators action-costs states conditional-effects negative-conditions typing adl domain-axioms - concept
T8 T9 T6 T7 T4 T5 T2 T3 T0 T1 T10 T11 T12 - tutorial
A1 A0 A3 A2 A5 A4 - activity
)

(:init 
(done S3 T0)
(done S3 T1)
(done S3 T2)
(done S3 T3)
(done S3 T4)
(done S3 T5)
(done S3 A0)
(done S3 A1)
(done S2 T0)
(done S2 T1)
(done S2 A0)
(done S4 T0)
(done S4 T1)
(done S4 T2)
(= (total-cost) 0)
)

(:goal
(and
(not (lock S3))
(not (lock S2))
(not (lock S1))
(not (lock S5))
(not (lock S4))
(used_concept S5 typing)
(used_concept S5 action-costs)
)
)

(:metric minimize (total-cost))

)

; plan
1. (do_tutorial_t8 s5)
   added: (has_concept s5 functions) (has_concept s5 action-costs)
   goals met: 5 of 7
2. (do_activity_a3 s5)
   added: (lock s5) (todo a3 s5) (apply adl a3) (apply domain-axioms a3) (apply conditional-effects a3) (need_contribution s5)
   goals met: 4 of 7
3. (do_tutorial_t0 s5)
   added: (has_concept s5 strips)
   goals met: 4 of 7
4. (do_tutorial_t1 s5)
   added: (has_concept s5 propositions)
   goals met: 4 of 7
5. (do_tutorial_t10 s5)
   added: (has_concept s5 conditional-effects)
   goals met: 4 of 7
6. (do_tutorial_t11 s5)
   added: (has_concept s5 domain-axioms)
   goals met: 4 of 7
7. (do_tutorial_t12 s5)
   added: (has_concept s5 temporal-constraints)
   goals met: 4 of 7
8. (do_tutorial_t2 s5)
   added: (has_concept s5 operators)
   goals met: 4 of 7
9. (do_tutorial_t3 s5)
   added: (has_concept s5 states)
   goals met: 4 of 7
10. (do_tutorial_t4 s5)
   added: (has_concept s5 negative-conditions)
   goals met: 4 of 7
11. (do_tutorial_t6 s5)
   added: (has_concept s5 typing)
   goals met: 4 of 7
12. (do_tutorial_t7 s5)
   added: (has_concept s5 equality)
   goals met: 4 of 7
13. (do_tutorial_t9 s5)
   added: (has_concept s5 adl)
   goals met: 4 of 7
14. (apply domain-axioms s5 a3)
   deleted: (apply domain-axioms a3) (need_contribution s5)
   added: (applied domain-axioms a3) (used_concept s5 domain-axioms)
   goals met: 4 of 7
15. (apply conditional-effects s5 a3)
   deleted: (apply conditional-effects a3)
   added: (applied conditional-effects a3) (used_concept s5 conditional-effects)
   goals met: 4 of 7
16. (apply adl s5 a3)
   deleted: (apply adl a3)
   added: (applied adl a3) (used_concept s5 adl)
   goals met: 4 of 7
17. (done_activity_a3 s5)
   deleted: (lock s5) (todo a3 s5) (applied adl a3) (applied domain-axioms a3) (applied conditional-effects a3)
   added: (done s5 a3)
   goals met: 5 of 7
18. (do_activity_a5 s5)
   added: (lock s5) (todo a5 s5) (apply temporal-constraints a5) (need_contribution s5)
   goals met: 4 of 7
19. (apply temporal-constraints s5 a5)
   deleted: (apply temporal-constraints a5) (need_contribution s5)
   added: (applied temporal-constraints a5) (used_concept s5 temporal-constraints)
   goals met: 4 of 7
20. (done_activity_a5 s5)
   deleted: (lock s5) (todo a5 s5) (applied temporal-constraints a5)
   added: (done s5 a5)
   goals met: 5 of 7
21. (do_activity_a1 s5)
   added: (lock s5) (todo a1 s5) (apply functions a1) (apply negative-conditions a1) (apply equality a1) (need_contribution s5)
   goals met: 4 of 7
22. (apply negative-conditions s5 a1)
   deleted: (apply negative-conditions a1) (need_contribution s5)
   added: (applied negative-conditions a1) (used_concept s5 negative-conditions)
   goals met: 4 of 7
23. (apply functions s5 a1)
   deleted: (apply functions a1)
   added: (applied functions a1) (used_concept s5 functions)
   goals met: 4 of 7
24. (apply equality s5 a1)
   deleted: (apply equality a1)
   added: (applied equality a1) (used_concept s5 equality)
   goals met: 4 of 7
25. (done_activity_a1 s5)
   deleted: (lock s5) (todo a1 s5) (applied functions a1) (applied negative-conditions a1) (applied equality a1)
   added: (done s5 a1)
   goals met: 5 of 7
26. (do_activity_a0 s5)
   added: (lock s5) (todo a0 s5) (apply strips a0) (apply propositions a0) (apply operators a0) (apply states a0) (apply action-costs a0) (apply typing a0) (need_contribution s5)
   goals met: 4 of 7
27. (apply typing s5 a0)
   deleted: (apply typing a0) (need_contribution s5)
   added: (applied typing a0) (used_concept s5 typing)
   goals met: 5 of 7
28. (apply strips s5 a0)
   deleted: (apply strips a0)
   added: (applied strips a0) (used_concept s5 strips)
   goals met: 5 of 7
29. (apply states s5 a0)
   deleted: (apply states a0)
   added: (applied states a0) (used_concept s5 states)
   goals met: 5 of 7
30. (apply propositions s5 a0)
   deleted: (apply propositions a0)
   added: (applied propositions a0) (used_concept s5 propositions)
   goals met: 5 of 7
31. (apply operators s5 a0)
   deleted: (apply operators a0)
   added: (applied operators a0) (used_concept s5 operators)
   goals met: 5 of 7
32. (apply action-costs s5 a0)
   deleted: (apply action-costs a0)
   added: (applied action-costs a0) (used_concept s5 action-costs)
   goals met: 6 of 7
33. (done_activity_a0 s5)
   deleted: (lock s5) (todo a0 s5) (applied strips a0) (applied propositions a0) (applied operators a0) (applied states a0) (applied action-costs a0) (applied typing a0)
   added: (done s5 a0)
   goals met: 7 of 7
